-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: j10c203.p.ssafy.io    Database: yeojung
-- ------------------------------------------------------
-- Server version	5.5.5-10.6.17-MariaDB-1:10.6.17+maria~ubu2004

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `trip_group`
--

DROP TABLE IF EXISTS `trip_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `trip_group` (
  `group_id` int(11) NOT NULL AUTO_INCREMENT,
  `end_date` date DEFAULT NULL,
  `group_name` varchar(10) DEFAULT NULL,
  `start_date` date DEFAULT NULL,
  `theme` varchar(50) DEFAULT NULL,
  `group_status` enum('BEFORE','SPLIT','DOING','DONE') DEFAULT 'BEFORE',
  PRIMARY KEY (`group_id`)
) ENGINE=InnoDB AUTO_INCREMENT=93 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `trip_group`
--

LOCK TABLES `trip_group` WRITE;
/*!40000 ALTER TABLE `trip_group` DISABLE KEYS */;
INSERT INTO `trip_group` VALUES (1,'2024-03-21','ㄷh','2024-01-11','ㅈㄱ','DONE'),(2,'2024-03-27','장충동왕족발보쌈','2024-03-25','장충동왕족발보쌈','BEFORE'),(3,'2024-03-11','ㄱㄱ','2024-01-01','ㄱㄱ','DONE'),(4,'2024-04-05','여행가요','2024-03-28','싸피','BEFORE'),(5,'2024-04-25','ㅎㅇㅎㅇ','2024-04-23','온천','BEFORE'),(6,'2024-03-28','그루비룸','2024-03-28','여행 테마','BEFORE'),(7,'2024-03-31','오렌지','2024-03-29','여행','SPLIT'),(8,'2024-03-31','감자좋아','2024-03-29','여행','DONE'),(9,'2024-04-19','ㄷㅈㅂㅅㄱ','2024-04-17','장충동왕족발보쌈','BEFORE'),(10,'2024-04-16','ㅊㅂㅊㅂ','2024-04-15','ㅌㅂㅊㄱㅈㅇ','BEFORE'),(11,'2024-03-30','에버랜드가자','2024-03-29','테마파크','SPLIT'),(12,'2024-03-30','서울랜드가자','2024-03-29','테마파크','DONE'),(13,'2024-04-26','ㄷㄱㅇㅂㅈㅂ','2024-04-22','ㄷㅂㄷㅂㅈㅅ','BEFORE'),(14,'2024-03-30','커피투어','2024-03-29','먹방','DONE'),(15,'2024-03-30','충주가자','2024-03-29','먹방','DONE'),(16,'2024-03-30','레서판다','2024-03-29','동물','BEFORE'),(17,'2024-04-25','부산여행','2024-04-24','전국일주!','BEFORE'),(18,'2024-04-25','ㄷㅂㅁㄱㅈ','2024-04-24','ㅇㄷㄱㅈㅂㅇ','BEFORE'),(19,'2024-05-16','ㅅㅂㅅㅂㅅㅂㅅㅂ','2024-05-14','ㄷㅂㄷㅂㄷㅂㅈㅂㄷ','BEFORE'),(20,'2024-04-24','ㄷㄱㅅㅂㅇㅂㅈ','2024-04-23','ㅅㄱㅈㄱㅂ','BEFORE'),(21,'2024-04-30','이거되나','2024-04-23','도나연','BEFORE'),(22,'2024-03-31','taehoTest','2024-03-29','ssi','DONE'),(23,'2024-04-25','니가먼데','2024-04-24','뚜루뚜뚜뚯뚜뚜','SPLIT'),(24,'2024-04-19','오늘밤은삐딱하게','2024-04-18','내버려둬','SPLIT'),(25,'2024-04-18','추카추카추카추','2024-04-17','포카포카포카포','SPLIT'),(26,'2024-04-10','qwe','2024-03-30','qwe','BEFORE'),(35,'2024-03-31','신영테스트','2024-03-31','여행 테마','DONE'),(40,'2024-03-31','양양여행','2024-03-31','벙벙개','DONE'),(41,'2024-03-31','주말 영화모임','2024-03-31','영화','SPLIT'),(42,'2024-04-02','장미좋아','2024-04-01','꽃구경','DONE'),(43,'2024-04-02','장미쪼아','2024-04-01','꽃구경','DONE'),(44,'2024-04-02','레서판다쪼아','2024-04-01','동물','DONE'),(45,'2024-04-02','수국조아','2024-04-01','꽃구경','DONE'),(46,'2024-04-02','먹방그룹','2024-04-01','먹방','BEFORE'),(47,'2024-04-02','물놀이가자','2024-04-01','물놀이','DONE'),(48,'2024-04-03','마우스','2024-04-01','빠름','DONE'),(49,'2024-05-15','초대해요','2024-05-14','온천','DONE'),(50,'2024-05-21','장덕동카페','2024-05-20','얼른와','BEFORE'),(51,'2024-04-05','ㅌㅌ','2024-04-01','ㅌㅌ','BEFORE'),(52,'2024-05-23','해치','2024-05-22','','BEFORE'),(53,'2024-04-03','목포 여행','2024-04-02','목포','BEFORE'),(54,'2024-04-03','목포여행','2024-04-02','목포','BEFORE'),(55,'2024-04-03','목포','2024-04-02','목포여행','DONE'),(56,'2024-04-03','ㅂㅂ','2024-04-01','ㅋㅋ','SPLIT'),(57,'2024-04-03','안뇽','2024-04-02','','DONE'),(58,'2024-04-03','qwer','2024-04-01','qwerqwer','BEFORE'),(59,'2024-04-03','qwer','2024-04-01','qwerqwer','BEFORE'),(60,'2024-04-03','zxcv','2024-04-01','zxcvzxcv','SPLIT'),(61,'2024-04-02','남해여행','2024-04-02','여행 테마','DONE'),(62,'2024-04-24','도토리','2024-04-23','운천저수지로','BEFORE'),(63,'2024-04-04','사이다','2024-04-03','먹방','SPLIT'),(64,'2024-04-03','테테','2024-04-01','테마','BEFORE'),(65,'2024-04-04','여기어때','2024-04-03','여행','DONE'),(67,'2024-04-05','싸피투어','2024-04-03','','DONE'),(68,'2024-04-04','test','2024-04-03','test','DONE'),(70,'2024-04-04','tt','2024-04-03','tt','DONE'),(71,'2024-04-19','dkdjdbdn','2024-04-16','wdddd','BEFORE'),(72,'2024-04-06','새그룹','2024-04-02','테마요','BEFORE'),(74,'2024-04-18','헝하하하','2024-04-17','후후후훟','DONE'),(75,'2024-04-04','jeju trip','2024-04-02','jeju','DONE'),(76,'2024-04-05','여행을 가자','2024-04-03','집도 가자','DONE'),(77,'2024-04-04','도레미','2024-04-03','음악여행','SPLIT'),(78,'2024-04-04','광주여행','2024-04-01','가자','DONE'),(79,'2024-04-04','롯데월드','2024-04-02','서울여행','DONE'),(80,'2024-04-05','정산완료테스트','2024-04-04','집에가자','DONE'),(81,'2024-04-03','시험용','2024-04-03','여행 테마','DONE'),(82,'2024-04-05','jung','2024-04-03','dd','DONE'),(83,'2024-04-05','skajwl','2024-04-03','zz','BEFORE'),(84,'2024-04-05','대전 여행','2024-04-03','전국일주!','BEFORE'),(85,'2024-04-05','추천 여행','2024-04-03','전국일주!','BEFORE'),(86,'2024-04-06','새그룹','2024-04-04','ㄴㄴ','DONE'),(87,'2024-04-06','두번째','2024-04-03','ㅇ','DONE'),(88,'2024-04-05','세번째 그룹','2024-04-03','ㅇ','DONE'),(89,'2024-04-05','네번째','2024-04-04','그룸','DONE'),(90,'2024-04-06','맛집투어','2024-04-04','먹방','DONE'),(91,'2024-04-06','맛집투어','2024-04-04','먹방','DONE'),(92,'2024-04-05','오렌지','2024-04-03','행복하자','BEFORE');
/*!40000 ALTER TABLE `trip_group` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-04  9:00:20
